const churchData = {
            "대전 중부지구": ["대흥동", "금산", "대사동", "목동", "문창동", "문화동", "버드내", "산성동", "선화동", "옥계동", "유천동", "진산성지", "태평동"],
            "대전 남부지구": ["가수원", "계룡", "관저동", "관저1동", "관저2동", "도마동", "도안동", "변동", "복수동", "정림동", "진잠"],
            "대전 동부지구": ["가양동", "가오동", "대동", "대화동", "법동", "삼성동", "성남동", "송촌동", "신탄진", "용전동", "자양동", "판암동"],
            "대전 서부지구": ["갈마동", "괴정동", "내동", "둔산동", "만년동", "월평동", "탄방동"],
            "대전 북부지구": ["관평동", "궁동", "노은동", "덕명동", "도룡동", "반석동", "봉산동", "원신흥동", "유성", "전민동", "죽동", "하기동"],
            "보령지구": ["갈매못성지", "대천", "대천해수욕장", "보령동대동", "서천", "서천서면", "웅천", "장항", "청양", "한산"],
            "논산지구": ["강경", "규암", "금사리", "논산내동", "논산대교동", "논산부창동", "부여", "연무", "홍산"],
            "아산지구": ["공세리", "도고", "둔포", "모산", "배방", "온양", "온양모종동", "온양신정동", "온양용화동", "온양풍기동", "장재"],
            "공주지구": ["공주교동", "공주신관동", "공주중동", "세종도원", "세종성바오로", "세종성베드로", "세종성요한", "세종성요한바오로2세", "세종성프란치스코", "유구", "전의", "조치원"],
            "홍성지구": ["광천", "덕산", "삽교", "신례원", "여사울성지", "예산", "예산산성리", "응봉", "홍북", "홍성"],
            "당진지구": ["기지시", "당진", "당진수청", "순성", "신리성지", "신평", "신합덕", "합덕"],
            "서산지구": ["대산", "서산동문동", "서산석림동", "서산예천동", "성연", "안면도", "운산", "태안", "해미"],
            "천안 동부지구": ["목천", "성환", "입장", "직산", "천안구룡동", "천안신부동", "천안오룡동", "천안원성동", "천안청당동"],
            "천안 서부지구": ["천안두정동", "천안봉명동", "천안불당동", "천안불당2동", "천안성정동", "천안신방동", "천안쌍용동", "천안쌍용2동", "천안쌍용3동", "천안용곡동", "월랑"]
        };